masumbillah74/controlpoint/nrf52_setup/nRF5_SDK_14.0.0_3bcc1f7/examples/ble_central_and_peripheral/experimental/peripheral/main.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdio.h>


#include "sdk_config.h"
//#include "boards.h"
#include "nrf.h"
#include "ble.h"
#include "ble_hci.h"
#include "nordic_common.h"
#include "nrf_gpio.h"
#include "bsp_btn_ble.h"
#include "ble_advdata.h"
#include "ble_srv_common.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "app_timer.h"
#include "app_error.h"
#include "nrf_cli.h"
#include "nrf_cli_rtt.h"
#include "nrf_cli_uart.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "ifs_tof.h"

//with conn interval = 25ms we can get 40 ToF samples per sec with three nodes. With more nodes only 20 ToF samples per sec are generated (connection events are skipped by the softdevice!)

#define CONN_INTERVAL_DEFAULT           (uint16_t)(MSEC_TO_UNITS(20, UNIT_1_25_MS))    /**< Default connection interval used at connection establishment by central side. */

#define CONN_INTERVAL_MIN               (uint16_t)(MSEC_TO_UNITS(7.5, UNIT_1_25_MS))    /**< Minimum acceptable connection interval, in 1.25 ms units. */
#define CONN_INTERVAL_MAX               (uint16_t)(MSEC_TO_UNITS(60, UNIT_1_25_MS))    /**< Maximum acceptable connection interval, in 1.25 ms units. */
#define CONN_SUP_TIMEOUT                (uint16_t)(MSEC_TO_UNITS(700,  UNIT_10_MS))    /**< Connection supervisory timeout (4 seconds). */
#define SLAVE_LATENCY                   0                                               /**< Slave latency. */

#define SCAN_ADV_LED                    BSP_BOARD_LED_0
#define READY_LED                       BSP_BOARD_LED_1
#define PROGRESS_LED                    BSP_BOARD_LED_2
#define DONE_LED                        BSP_BOARD_LED_3

#define BOARD_TESTER_BUTTON             BSP_BUTTON_2                                    /**< Button to press at beginning of the test to indicate that this board is connected to the PC and takes input from it via the UART. */
#define BOARD_DUMMY_BUTTON              BSP_BUTTON_3                                    /**< Button to press at beginning of the test to indicate that this board is standalone (automatic behavior). */
#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50)                             /**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */

#define APP_BLE_CONN_CFG_TAG            1                                               /**< A tag that refers to the BLE stack configuration. */
#define APP_BLE_OBSERVER_PRIO           1                                               /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define L2CAP_HDR_LEN                   4                                               /**< L2CAP header length. */



#define MAXIMUM_NETWORK_SIZE			NRF_SDH_BLE_TOTAL_LINK_COUNT
#define MAXIMUM_NUMBER_OF_PERIPH_CONN	NRF_SDH_BLE_PERIPHERAL_LINK_COUNT
#define MAXIMUM_NUMBER_OF_CENTRAL_CONN	6//IFT_TOF_MAX_NUM_OF_CENTRAL_LINKS

//#define DISABLE_ADV
//#define ENABLE_PHY_UPDATE
#define ENABLE_GATT
#define USE_NANOSECOND

#define TCS_UUID_LIT_END {0x42, 0x00, 0x74, 0xa9, 0xff, 0x52, 0x10, 0x9b, 0x33, 0x49, 0x35, 0x9b, 0x00, 0x01, 0x68, 0xef}; //little endian!!

#ifdef ENABLE_PHY_UPDATE
#if defined(S132)
#undef ENABLE_PHY_UPDATE
#warning "Phy update is not available in sofdevice S132, then phy and won't be updated"
#endif
#endif

typedef enum
{
    NOT_SELECTED = 0x00,
    BOARD_TESTER,
    BOARD_DUMMY,
} board_role_t;

typedef struct
{
    uint16_t        att_mtu;                    /**< GATT ATT MTU, in bytes. */
    uint16_t        conn_interval;              /**< Connection interval expressed in units of 1.25 ms. */
    ble_gap_phys_t  phys;                       /**< Preferred PHYs. */
    bool            data_len_ext_enabled;       /**< Data length extension status. */
    bool            conn_evt_len_ext_enabled;   /**< Connection event length extension status. */
    bool 			continuous_test;			/**< if set to true the test keeps going on (works without data stream) */
} test_params_t;

/**@brief Variable length data encapsulation in terms of length and pointer to data. */
typedef struct
{
    uint8_t  * p_data;      /**< Pointer to data. */
    uint16_t   data_len;    /**< Length of data. */
} data_t;

typedef struct
{
    uint16_t  			conn_handle;
    uint8_t             local_role;
	ble_gap_addr_t 		bd_address;
} node_t;

#ifdef ENABLE_GATT
NRF_BLE_GATT_DEF(m_gatt);                   /**< GATT module instance. */
BLE_DB_DISCOVERY_DEF(m_ble_db_discovery);   /**< DB discovery module instance. */
#endif

//static nrf_ble_amtc_t     m_amtc;
//static nrf_ble_amts_t     m_amts;
//NRF_SDH_BLE_OBSERVER(m_amtc_ble_obs, BLE_AMTC_BLE_OBSERVER_PRIO, nrf_ble_amtc_on_ble_evt, &m_amtc);
//NRF_SDH_BLE_OBSERVER(m_amts_ble_obs, BLE_AMTS_BLE_OBSERVER_PRIO, nrf_ble_amts_on_ble_evt, &m_amts);
//#endif


NRF_CLI_UART_DEF(cli_uart, 0, 64, 16);
NRF_CLI_RTT_DEF(cli_rtt);
NRF_CLI_DEF(m_cli_uart, "throughput example:~$ ", &cli_uart.transport, '\r', 4);
NRF_CLI_DEF(m_cli_rtt,  "throughput example:~$ ", &cli_rtt.transport,  '\n', 4);

static board_role_t volatile m_board_role  = NOT_SELECTED;

static bool volatile m_run_test;

#ifdef ENABLE_GATT
static bool volatile m_mtu_exchanged;
static bool volatile m_data_length_updated;
#endif

#ifdef ENABLE_PHY_UPDATE
static bool volatile m_phy_updated;
#endif
static bool volatile m_conn_interval_configured;
//static uint8_t m_gap_role = BLE_GAP_ROLE_INVALID;


// Name to use for advertising and connection.
static char const m_target_periph_name[] = DEVICE_NAME;
static char const m_target_periph_name_alt[] = {'C',
												'L',
												'I',
												'M',
												'B',
												'L'};

static const uint8_t			  m_target_uuid_lit_end[] = TCS_UUID_LIT_END;

static uint8_t m_no_of_central_links = 0;
static uint8_t m_no_of_peripheral_links = 0;
static ifs_tof_t m_ifs_tof[MAXIMUM_NUMBER_OF_CENTRAL_CONN];
static uint32_t ifs_offset_ticks;
static bool allow_new_connections = false;
static bool pending_connection_req = false;

int8_t rssi[TOF_SAMPLES_TO_ACQUIRE];
uint32_t frequency_reg[TOF_SAMPLES_TO_ACQUIRE];
uint16_t total_number_of_connection_events;
bool m_scan_active = false, m_advertising_active = false;
static node_t m_network[MAXIMUM_NETWORK_SIZE];

// Test parameters.
// Settings like ATT MTU size are set only once on the dummy board.
// Make sure that defaults are sensible.
static test_params_t m_test_params =
{
    .att_mtu                  = BLE_GATT_ATT_MTU_DEFAULT, //NRF_SDH_BLE_GATT_MAX_MTU_SIZE,
    .conn_interval            = CONN_INTERVAL_DEFAULT,
    .data_len_ext_enabled     = false,
    .conn_evt_len_ext_enabled = false,
	.continuous_test		  = true,
    // Only symmetric PHYs are supported.
#if defined(S140)
    .phys.tx_phys             = BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_CODED,
    .phys.rx_phys             = BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_CODED,
#else
    .phys.tx_phys             = BLE_GAP_PHY_1MBPS,//BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS,
    .phys.rx_phys             = BLE_GAP_PHY_1MBPS,//BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS,
#endif
};

// Scan parameters requested for scanning and connection.
static ble_gap_scan_params_t const m_scan_param =
{
    .active         = 0x00,
    .interval       = SCAN_INTERVAL,
    .window         = SCAN_WINDOW,
    .use_whitelist  = 0x00,
    .adv_dir_report = 0x00,
    .timeout        = 0x0000, // No timeout.
};

// Connection parameters requested for connection.
static ble_gap_conn_params_t m_conn_param =
{
    .min_conn_interval = CONN_INTERVAL_MIN,   // Minimum connection interval.
    .max_conn_interval = CONN_INTERVAL_MAX,   // Maximum connection interval.
    .slave_latency     = SLAVE_LATENCY,       // Slave latency.
    .conn_sup_timeout  = CONN_SUP_TIMEOUT     // Supervisory timeout.
};


