masumbillah74/controlpoint/nrf52_setup/nRF5_SDK_14.0.0_3bcc1f7/examples/ble_central_and_peripheral/experimental/peripheral/main.c
void test_terminate(void);
static void scan_start(void);
static void advertising_start(void);
static void advertising_stop(void);
void ifs_tof_evt_handler(ifs_tof_evt_t * p_evt);
static void scan_stop(void);
static bool is_link_present(ble_gap_evt_adv_report_t const * p_adv_report);
static node_t* add_node_to_network(const ble_gap_evt_t *p_evt);
node_t* get_first_free_network_pos(void);
node_t* get_network_pos_by_conn_handle(uint16_t target_conn_h);
void test_begin(void);
static void test_run(void);
static bool is_test_ready();

static void reset_network(void){
	memset(m_network, 0x00, MAXIMUM_NETWORK_SIZE*sizeof(node_t));
	for(uint8_t n = 0; n < MAXIMUM_NETWORK_SIZE; n++){
		m_network[n].conn_handle = BLE_CONN_HANDLE_INVALID;
	}
}

static node_t* add_node_to_network(const ble_gap_evt_t *p_evt){
	node_t* p_node = get_first_free_network_pos();
	if(p_node == NULL){
		return NULL;
	}

	p_node->conn_handle = p_evt->conn_handle;
	memcpy(&p_node->bd_address, &p_evt->params.connected.peer_addr, sizeof(ble_gap_addr_t));
	p_node->local_role = p_evt->params.connected.role;
	return p_node;
}

static void remove_node_from_network(const ble_gap_evt_t *p_evt){
	node_t* p_node = get_network_pos_by_conn_handle(p_evt->conn_handle);
	if(p_node == NULL){
		return;
	}

	p_node->conn_handle = BLE_CONN_HANDLE_INVALID;
	memset(&p_node->bd_address, 0x00, sizeof(ble_gap_addr_t));
	p_node->local_role = BLE_GAP_ROLE_INVALID;
	return;
}

node_t* get_first_free_network_pos(void){
	return get_network_pos_by_conn_handle(BLE_CONN_HANDLE_INVALID); //a free position is marked with conn_handle == BLE_CONN_HANDLE_INVALID
}

node_t* get_network_pos_by_conn_handle(uint16_t target_conn_h){
	for(uint8_t n = 0; n < MAXIMUM_NETWORK_SIZE; n++){
		if(m_network[n].conn_handle == target_conn_h){
			return &m_network[n];
		}
	}
	return NULL;
}

static uint32_t calculate_ifs_offset(ble_gap_phys_t actual_phy) {
//#ifdef S140
	uint8_t data_rate_mbps;
	switch (actual_phy.rx_phys) {
	case BLE_GAP_PHY_1MBPS:
		data_rate_mbps = 1;
		return (uint32_t) (T_IFS_us + PREAMBLE_LEGNTH_us + ACCESS_ADDRESS_LENGTH_bit / data_rate_mbps + RX_CHAIN_DELAY_1MPHY_us)
				* IFS_TIMER_TICK_FREQUENCY_MHZ;

	case BLE_GAP_PHY_2MBPS:
		data_rate_mbps = 2;
		return (uint32_t) (T_IFS_us + PREAMBLE_LEGNTH_us + ACCESS_ADDRESS_LENGTH_bit / data_rate_mbps + RX_CHAIN_DELAY_2MPHY_us)
				* IFS_TIMER_TICK_FREQUENCY_MHZ;

	case BLE_GAP_PHY_CODED:
		return 0;
		break;
	default:
		data_rate_mbps = 1;
		return (uint32_t) (T_IFS_us + PREAMBLE_LEGNTH_us + ACCESS_ADDRESS_LENGTH_bit / data_rate_mbps + RX_CHAIN_DELAY_1MPHY_us)
				* IFS_TIMER_TICK_FREQUENCY_MHZ;
		break;
	}
//#else
//	return (uint32_t) (T_IFS_us + PREAMBLE_LEGNTH_us + ACCESS_ADDRESS_LENGTH_bit + RX_CHAIN_DELAY_1MPHY_us) * IFS_TIMER_TICK_FREQUENCY_MHZ;
//#endif
}


char const * phy_str(ble_gap_phys_t phys)
{
    static char const * str[] =
    {
        "1 Mbps",
        "2 Mbps",
        "Coded",
        "Unknown"
    };

    switch (phys.tx_phys)
    {
        case BLE_GAP_PHY_1MBPS:
            return str[0];

        case BLE_GAP_PHY_2MBPS:
        case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS:
        case BLE_GAP_PHY_2MBPS | BLE_GAP_PHY_1MBPS | BLE_GAP_PHY_CODED:
            return str[1];

        case BLE_GAP_PHY_CODED:
            return str[2];

        default:
            return str[3];
	}
}

uint32_t bd_addr_to_string(const ble_gap_addr_t *p_addr, char* p_str) {
	return sprintf(p_str, "%02X:%02X:%02X:%02X:%02X:%02X", p_addr->addr[5], p_addr->addr[4], p_addr->addr[3], p_addr->addr[2], p_addr->addr[1],
			p_addr->addr[0]);
}

void tof_results_print(ifs_tof_t * p_ctx) {
//	if (m_board_role == BOARD_TESTER)
	{
		char c;
		if (m_test_params.continuous_test) {
			c = 's'; //when the test is continuous just print the summary
		}else{
			c = 'p';
		}

		if (c == 'p' || c == 's') {

			float ifs_duration_ticks_avg = 0;
			float rssi_avg = 0;

			static char addr_str[30]; //18 should be enough, but it mess up
			static uint8_t count = 0;
			bd_addr_to_string(&p_ctx->bd_address, addr_str);

			for (uint32_t i = 0; i < TOF_SAMPLES_TO_ACQUIRE; i++) {
				if (c == 'p') {
#ifdef USE_NANOSECOND
					NRF_LOG_INFO("i = %u ifs_duration_ticks = %u ticks rssi = %d dBm radio_freq = 0x%08x\n\r", i,
							p_ctx->buffer[i].ifs_duration_ticks, p_ctx->buffer[i].rssi,
							p_ctx->buffer[i].frequency_reg);
#else
					NRF_LOG_INFO("i = %u ifs_duration_ticks = %u ns rssi = %d dBm radio_freq = 0x%08x\n\r", i,
							p_ctx->buffer[i].ifs_duration_ticks, p_ctx->buffer[i].rssi,
							p_ctx->buffer[i].frequency_reg);
#endif
				}

				ifs_duration_ticks_avg += p_ctx->buffer[i].ifs_duration_ticks;
				rssi_avg += p_ctx->buffer[i].rssi;

				if (i % 25 == 0 && c == 'p') {
					NRF_LOG_FLUSH()
					;
				}
			}
			ifs_duration_ticks_avg = ifs_duration_ticks_avg / TOF_SAMPLES_TO_ACQUIRE;
			rssi_avg = rssi_avg / TOF_SAMPLES_TO_ACQUIRE;

			//NRF_LOG_INFO("bd_addr = %s ",addr_str);
			//TODO: it should be better to use NRF_LOG_DEFERRED, but when in use the mcu locks when nobody reads from uart
			//TODO: I changed the source code of nrf_log_frontend.c to fix the problem of NRF_LOG_DEFERRED. The code has been written by a member of the forum, not by nordic
			char line[300];
#ifdef USE_NANOSECOND
			float ifs_duration_ns_comp_avg = (ifs_duration_ticks_avg - ifs_offset_ticks)/(((float)IFS_TIMER_TICK_FREQUENCY_MHZ) / 1000);
			if(TOF_SAMPLES_TO_ACQUIRE == 1){
				sprintf(line, "bd_addr = %s ifs_duration_ns = "NRF_LOG_FLOAT_MARKER" ns rssi = %d dBm radio_freq = 0x%08x c = %d\n\r",addr_str,NRF_LOG_FLOAT(ifs_duration_ns_comp_avg), p_ctx->buffer[0].rssi,(unsigned int)p_ctx->buffer[0].frequency_reg,count++);
				NRF_LOG_INFO("%s",nrf_log_push(line));
				//NRF_LOG_RAW_INFO("ifs_duration_ns = "NRF_LOG_FLOAT_MARKER" ns rssi = "NRF_LOG_FLOAT_MARKER" dBm",NRF_LOG_FLOAT(ifs_duration_ns_comp_avg), NRF_LOG_FLOAT(rssi_avg));
				//NRF_LOG_RAW_INFO(" radio_freq = 0x%08x c = %d\n\r",p_ctx->buffer[0].frequency_reg,count++);
			}else{
				sprintf(line, "bd_addr = %s ifs_duration_ns = "NRF_LOG_FLOAT_MARKER" ns rssi = "NRF_LOG_FLOAT_MARKER" dBm c = %d\n\r",addr_str,NRF_LOG_FLOAT(ifs_duration_ns_comp_avg), NRF_LOG_FLOAT(rssi_avg),count++);
				NRF_LOG_INFO("%s",nrf_log_push(line));
				//NRF_LOG_RAW_INFO("ifs_duration_ns_avg = "NRF_LOG_FLOAT_MARKER" ns rssi_avg = "NRF_LOG_FLOAT_MARKER" dBm\n\r",NRF_LOG_FLOAT(ifs_duration_ns_comp_avg), NRF_LOG_FLOAT(rssi_avg));
			}
#else
			if(TOF_SAMPLES_TO_ACQUIRE == 1){
				//NRF_LOG_RAW_INFO("ifs_duration_ticks = %d rssi = %d dBm", ((int32_t)p_ctx->buffer[0].ifs_duration_ticks)-ifs_offset_ticks, p_ctx->buffer[0].rssi);
				//NRF_LOG_RAW_INFO(" radio_freq = 0x%08x\n\r",p_ctx->buffer[0].frequency_reg);
				sprintf(line, "bd_addr = %s ifs_duration_ticks = %d ticks rssi = %d dBm radio_freq = 0x%08x c = %d\n\r",addr_str,((int32_t)p_ctx->buffer[0].ifs_duration_ticks)-ifs_offset_ticks, p_ctx->buffer[0].rssi,(unsigned int)p_ctx->buffer[0].frequency_reg,count++);
				NRF_LOG_INFO("%s",nrf_log_push(line));
			}else{
				//NRF_LOG_RAW_INFO("Average values are ifs_duration_ticks_avg = "NRF_LOG_FLOAT_MARKER" rssi_avg = "NRF_LOG_FLOAT_MARKER"\n\r",
				//NRF_LOG_FLOAT(ifs_duration_ticks_avg), NRF_LOG_FLOAT(rssi_avg));
				sprintf(line, "bd_addr = %s ifs_duration_ticks = "NRF_LOG_FLOAT_MARKER" ticks rssi = "NRF_LOG_FLOAT_MARKER" dBm\n\r",addr_str,NRF_LOG_FLOAT(ifs_duration_ticks_avg), NRF_LOG_FLOAT(rssi_avg));
				NRF_LOG_INFO("%s",nrf_log_push(line));
			}
#endif

			if (!m_test_params.continuous_test) {
				NRF_LOG_INFO("Total number of connection events %u, %u packets were not received",
						p_ctx->buffer[TOF_SAMPLES_TO_ACQUIRE- 1].connection_events_counter,
						p_ctx->buffer[TOF_SAMPLES_TO_ACQUIRE - 1].connection_events_counter - TOF_SAMPLES_TO_ACQUIRE);
				for(uint8_t idx = 0; idx < TOF_SAMPLES_TO_ACQUIRE; idx++){
					NRF_LOG_INFO("idx = %u", p_ctx->buffer[idx].connection_events_counter);
				}
			}
		}
	}
}

static void instructions_print(void)
{
    NRF_LOG_INFO("Type 'config' to change the configuration parameters.\n\r");
    NRF_LOG_FLUSH();
    NRF_LOG_INFO("You can use the TAB key to autocomplete your input.\n\r");
    NRF_LOG_FLUSH();
    NRF_LOG_INFO("Type 'r' when you are ready to run the test.\n\r");
    NRF_LOG_FLUSH();
}


/**@brief Parses advertisement data, providing length and location of the field in case
 *        matching data is found.
 *
 * @param[in]  Type of data to be looked for in advertisement data.
 * @param[in]  Advertisement report length and pointer to report.
 * @param[out] If data type requested is found in the data report, type data length and
 *             pointer to data will be populated here.
 *
 * @retval NRF_SUCCESS if the data type is found in the report.
 * @retval NRF_ERROR_NOT_FOUND if the data type could not be found.
 */
static uint32_t adv_report_parse(uint8_t type, data_t * p_advdata, data_t * p_typedata)
{
    uint32_t  index = 0;
    uint8_t * p_data;

