masumbillah74/controlpoint/nrf52_setup/nRF5_SDK_14.0.0_3bcc1f7/examples/ble_central_and_peripheral/experimental/peripheral/main.c
    p_data = p_advdata->p_data;

    while (index < p_advdata->data_len)
    {
        uint8_t field_length = p_data[index];
        uint8_t field_type   = p_data[index + 1];

        if (field_type == type)
        {
            p_typedata->p_data   = &p_data[index + 2];
            p_typedata->data_len = field_length - 1;
            return NRF_SUCCESS;
        }
        index += field_length + 1;
    }
    return NRF_ERROR_NOT_FOUND;
}


/**@brief Function for searching a given name in the advertisement packets.
 *
 * @details Use this function to parse received advertising data and to find a given
 * name in them either as 'complete_local_name' or as 'short_local_name'.
 *
 * @param[in]   p_adv_report   advertising data to parse.
 * @param[in]   name_to_find   name to search.
 * @return   true if the given name was found, false otherwise.
 */
static bool find_adv_name(ble_gap_evt_adv_report_t const * p_adv_report, char const * name_to_find)
{
    ret_code_t err_code;
    data_t     adv_data;
    data_t     dev_name;
    bool       found = false;

    // Initialize advertisement report for parsing.
    adv_data.p_data   = (uint8_t *)p_adv_report->data;
    adv_data.data_len = p_adv_report->dlen;

    // Search for matching advertising names.
    err_code = adv_report_parse(BLE_GAP_AD_TYPE_COMPLETE_LOCAL_NAME, &adv_data, &dev_name);

    if (   (err_code == NRF_SUCCESS)
        && (strlen(name_to_find) == dev_name.data_len)
        && (memcmp(name_to_find, dev_name.p_data, dev_name.data_len) == 0))
    {
        found = true;
    }
    else
    {
        // Look for the short local name if the complete name was not found.
        err_code = adv_report_parse(BLE_GAP_AD_TYPE_SHORT_LOCAL_NAME, &adv_data, &dev_name);

        if (   (err_code == NRF_SUCCESS)
            && (strlen(name_to_find) == dev_name.data_len)
            && (memcmp(m_target_periph_name, dev_name.p_data, dev_name.data_len) == 0))
        {
            found = true;
        }
    }

    return found;
}

//finds the first 16bit uuid included in the adv data
static uint32_t get_adv_128bit_uuid(ble_gap_evt_adv_report_t const * p_adv_report, data_t * uuid_data) {

	ret_code_t err_code;
	data_t adv_data;

	// Initialize advertisement report for parsing.
	adv_data.p_data = (uint8_t *) p_adv_report->data;
	adv_data.data_len = p_adv_report->dlen;

	err_code = adv_report_parse(BLE_GAP_AD_TYPE_128BIT_SERVICE_UUID_MORE_AVAILABLE, &adv_data, uuid_data);

	return err_code;
}

bool is_128bit_uuid_included(ble_gap_evt_adv_report_t const * p_adv_report, uint8_t const *target_uuid){
	ret_code_t err_code;
	bool found = false;
	data_t uuid_data;

	err_code = get_adv_128bit_uuid(p_adv_report, &uuid_data);
	if (err_code == NRF_SUCCESS) {
		if (uuid_data.data_len == 16) {
			if( memcmp(target_uuid, uuid_data.p_data, 16) == 0 ){
				found = true;
			} else { 	//an uuid has been found, but it doesn't mathc the eddystone uuid
				found = false;
			}
		} else {	//the uuid data found is not long 2 (this should never happen)
			found = false;
		}
	} else {	//no 16bit uuid found in the adv packet
		found = false;
	}

	return found;
}

static bool is_adv_connectable(ble_gap_evt_adv_report_t const * p_adv_report){

//    ret_code_t err_code;
//	data_t flags;
//    data_t     adv_data;
//    adv_data.p_data   = (uint8_t *)p_adv_report->data;
//    adv_data.data_len = p_adv_report->dlen;

    if(p_adv_report->type == BLE_GAP_ADV_TYPE_ADV_IND ){
    	return true;
    }else{
    	return false;
    }

//	err_code = adv_report_parse(BLE_GAP_AD_TYPE_FLAGS, &adv_data, &flags);
//
//	if (err_code != NRF_SUCCESS){
//		return false;
//	}else{
//		return flags.p_data[0] && (BLE_GAP_ADV_FLAG_LE_GENERAL_DISC_MODE | BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED);
//	}
}


static bool is_link_present(ble_gap_evt_adv_report_t const * p_adv_report){

	for(uint8_t n = 0; n < MAXIMUM_NETWORK_SIZE; n++){
		if(m_network[n].conn_handle != BLE_CONN_HANDLE_INVALID){
			if(memcmp(&p_adv_report->peer_addr, &m_network[n].bd_address, sizeof(ble_gap_addr_t) )== 0){
				return true;
			}
		}
	}
	return false;
}
/**@brief Function for handling BLE_GAP_ADV_REPORT events.
 * Search for a peer with matching device name.
 * If found, stop advertising and send a connection request to the peer.
 */
static void on_ble_gap_evt_adv_report(ble_gap_evt_t const * p_gap_evt) {

	if (!is_adv_connectable(&p_gap_evt->params.adv_report)) {
		return;
	}

	if (!find_adv_name(&p_gap_evt->params.adv_report, m_target_periph_name)
			&& !find_adv_name(&p_gap_evt->params.adv_report, m_target_periph_name_alt)
			&& !is_128bit_uuid_included(&p_gap_evt->params.adv_report,  m_target_uuid_lit_end)) {
		return;
	}

	if(is_link_present(&p_gap_evt->params.adv_report)){
		return;
	}

    bsp_board_led_invert(PROGRESS_LED);

//	if(m_board_role == BOARD_DUMMY){
//		return;
//	}

	if (allow_new_connections && m_no_of_central_links < MAXIMUM_NUMBER_OF_CENTRAL_CONN ) {

		static char addr_str[30]; //18 should be enough, but it mess up
		bd_addr_to_string(& p_gap_evt->params.adv_report.peer_addr, addr_str);

		NRF_LOG_INFO("Device \"%s\", bd_addr \"%s\" found, sending a connection request.\n\r", (uint32_t ) m_target_periph_name,addr_str);

		scan_stop();
		//advertising_stop();


		// Initiate connection.
		m_conn_param.min_conn_interval = CONN_INTERVAL_DEFAULT;
		m_conn_param.max_conn_interval = CONN_INTERVAL_DEFAULT;

		ble_gap_scan_params_t const m_init_param =
		{
		    .active         = 0x00,
		    .interval       = SCAN_WINDOW,
		    .window         = SCAN_WINDOW,
		    .use_whitelist  = 0x00,
		    .adv_dir_report = 0x00,
		    .timeout        = 0x0000, // No timeout.
		};

		ret_code_t err_code;
		err_code = sd_ble_gap_connect(&p_gap_evt->params.adv_report.peer_addr, &m_init_param, &m_conn_param,APP_BLE_CONN_CFG_TAG);

		if (err_code != NRF_SUCCESS) {
			NRF_LOG_ERROR("sd_ble_gap_connect() failed: 0x%x.\n\r", err_code);
		}else{
			pending_connection_req = true;
		}
	}
}

/**@brief Function for handling BLE_GAP_EVT_CONNECTED events.
 * Save the connection handle and GAP role, then discover the peer DB.
 */
static void on_ble_gap_evt_connected(ble_gap_evt_t const * p_gap_evt)
{
    ret_code_t err_code;
    //m_conn_handle = p_gap_evt->conn_handle;
    //m_gap_role    = p_gap_evt->params.connected.role;
    node_t* p_node = add_node_to_network(p_gap_evt);
    if(p_node == NULL){
    	return;
    }
    bsp_board_leds_off();

    if (p_node->local_role == BLE_GAP_ROLE_PERIPH)
    {
		NRF_LOG_INFO("Connected as a peripheral.\n\r");
		m_no_of_peripheral_links++;
		if (m_no_of_peripheral_links < MAXIMUM_NUMBER_OF_PERIPH_CONN) {
			m_advertising_active = false; //workaround needed
			advertising_start();
		} else {
        	//advertising_stop();
        }
    }
    else if (p_node->local_role == BLE_GAP_ROLE_CENTRAL)
    {
        NRF_LOG_INFO("Connected as a central.\n\r");

