masumbillah74/controlpoint/nrf52_setup/nRF5_SDK_14.0.0_3bcc1f7/examples/ble_central_and_peripheral/experimental/peripheral/main.c
        pending_connection_req = false;
		m_no_of_central_links++;
		ifs_tof_register_conn_handle(p_gap_evt, ifs_tof_evt_handler);
		if(m_board_role == BOARD_DUMMY){
			advertising_start();
		}
		if (m_no_of_central_links < MAXIMUM_NUMBER_OF_CENTRAL_CONN) {
			//scan_start();
		} else {
			scan_stop();
		}

		if (m_test_params.conn_interval != CONN_INTERVAL_DEFAULT) {
			NRF_LOG_DEBUG("Updating connection parameters..\n\r");
			m_conn_param.min_conn_interval = m_test_params.conn_interval;
			m_conn_param.max_conn_interval = m_test_params.conn_interval;
			err_code = sd_ble_gap_conn_param_update(p_node->local_role, &m_conn_param);

			if (err_code != NRF_SUCCESS) {
				NRF_LOG_ERROR("sd_ble_gap_conn_param_update() failed: 0x%x.\n\r", err_code);
			}
		} else {
			m_conn_interval_configured = true;
		}

	#ifdef ENABLE_PHY_UPDATE
	    if (p_gap_evt->params.connected.role == BLE_GAP_ROLE_PERIPH)
	    {
	    #if defined(S140)
	        err_code = sd_ble_gap_phy_request(p_gap_evt->conn_handle, &m_test_params.phys);
	        APP_ERROR_CHECK(err_code);
	    #else
	        err_code = sd_ble_gap_phy_update(p_gap_evt->conn_handle, &m_test_params.phys);
	        APP_ERROR_CHECK(err_code);
	    #endif
	    }
	#endif
	}

	NRF_LOG_INFO("Connection interval: "NRF_LOG_FLOAT_MARKER" ms, Slave latency: %d, Supervision timeout %d ms.\n\r", NRF_LOG_FLOAT(1.25 * p_gap_evt->params.connected.conn_params.max_conn_interval), p_gap_evt->params.connected.conn_params.slave_latency, p_gap_evt->params.connected.conn_params.conn_sup_timeout * 10 );

	bsp_board_led_on(READY_LED);

    // If some gatt operation are used, next lines must be uncommented to trigger the service discovery.
    // Form the contextual point of view all modules interested to gatt will add the UUID they are interested in using sd_ble_uuid_vs_add(...), while the application (main.c) will start the discovery in the next lines.
    // Discovery events are passed to modules by the application (main.c) inside db_disc_evt_handler(...)
    //memset(&m_ble_db_discovery, 0x00, sizeof(m_ble_db_discovery));
	//NRF_LOG_INFO("Discovering GATT database...\n\r");
    //err_code  = ble_db_discovery_start(&m_ble_db_discovery, p_gap_evt->conn_handle);
	//APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling BLE_GAP_EVT_DISCONNECTED events.
 * Unset the connection handle and terminate the test.
 */
static void on_ble_gap_evt_disconnected(ble_gap_evt_t const * p_gap_evt)
{
	ifs_tof_unregister_conn_handle(p_gap_evt->conn_handle);

    NRF_LOG_DEBUG("Disconnected: reason 0x%x.\n\r", p_gap_evt->params.disconnected.reason);

    node_t * p_node = get_network_pos_by_conn_handle(p_gap_evt->conn_handle);
	if (p_node->local_role == BLE_GAP_ROLE_CENTRAL) {
		m_no_of_central_links--;
	    if (m_run_test)
	    {
	    	static char addr_str[30]; //18 should be enough, but it mess up
	    	bd_addr_to_string(&p_node->bd_address, addr_str);
	        NRF_LOG_INFO("addr_str: \"%s\" GAP disconnection from Central role while test was running.\n\r",addr_str)
	    }
	} else {
		m_no_of_peripheral_links--;
	    if (m_run_test)
	    {
	    	static char addr_str[30]; //18 should be enough, but it mess up
	    	bd_addr_to_string(&p_node->bd_address, addr_str);
	    	NRF_LOG_INFO("addr_str: \"%s\" GAP disconnection from Peripheral role while test was running.\n\r",addr_str)
	    }
	}

	if(!pending_connection_req){
		if(m_board_role == BOARD_DUMMY){
			advertising_start();
		}
		//scan_start();
	}
	bsp_board_led_off(READY_LED);

	if(m_no_of_central_links == 0){
		//bsp_board_leds_off();
	//	test_terminate();
	}

	remove_node_from_network(p_gap_evt);
}


/**@brief Function for handling BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    uint32_t              err_code;
    ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
            on_ble_gap_evt_adv_report(p_gap_evt);
            break;

        case BLE_GAP_EVT_CONNECTED:
            on_ble_gap_evt_connected(p_gap_evt);
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            on_ble_gap_evt_disconnected(p_gap_evt);
            break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE:
        {
            m_conn_interval_configured = true;
            NRF_LOG_INFO("Connection interval updated: 0x%x, 0x%x.\n\r",
                p_gap_evt->params.conn_param_update.conn_params.min_conn_interval,
                p_gap_evt->params.conn_param_update.conn_params.max_conn_interval);
        } break;

        case BLE_GAP_EVT_CONN_PARAM_UPDATE_REQUEST:
        {
            // Accept parameters requested by the peer.
            ble_gap_conn_params_t params;
            params = p_gap_evt->params.conn_param_update_request.conn_params;
            err_code = sd_ble_gap_conn_param_update(p_gap_evt->conn_handle, &params);
            APP_ERROR_CHECK(err_code);

            NRF_LOG_INFO("Connection interval updated (upon request): 0x%x, 0x%x.\n\r",
                p_gap_evt->params.conn_param_update_request.conn_params.min_conn_interval,
                p_gap_evt->params.conn_param_update_request.conn_params.max_conn_interval);
        } break;

        case BLE_GATTS_EVT_SYS_ATTR_MISSING:
        {
            err_code = sd_ble_gatts_sys_attr_set(p_gap_evt->conn_handle, NULL, 0, 0);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_GATTC_EVT_TIMEOUT: // Fallthrough.
        case BLE_GATTS_EVT_TIMEOUT:
        {
            NRF_LOG_DEBUG("GATT timeout, disconnecting.\n\r");
            err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gap_evt.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            APP_ERROR_CHECK(err_code);
        } break;

        case BLE_EVT_USER_MEM_REQUEST:
        {
            err_code = sd_ble_user_mem_reply(p_ble_evt->evt.common_evt.conn_handle, NULL);
            APP_ERROR_CHECK(err_code);
        } break;
#ifdef ENABLE_PHY_UPDATE
        case BLE_GAP_EVT_PHY_UPDATE:
        {
            ble_gap_evt_phy_update_t const * p_phy_evt = &p_ble_evt->evt.gap_evt.params.phy_update;

            if (p_phy_evt->status == BLE_HCI_STATUS_CODE_LMP_ERROR_TRANSACTION_COLLISION)
            {
                // Ignore LL collisions.
                NRF_LOG_DEBUG("LL transaction collision during PHY update.\n\r");
                break;
            }

            m_phy_updated = true;

            ble_gap_phys_t phys = {0};
            phys.tx_phys = p_phy_evt->tx_phy;
            phys.rx_phys = p_phy_evt->rx_phy;

            ifs_offset_ticks = calculate_ifs_offset(phys);

