masumbillah74/controlpoint/nrf52_setup/nRF5_SDK_14.0.0_3bcc1f7/examples/ble_central_and_peripheral/experimental/peripheral/main.c
    ret_code_t err_code = nrf_cli_init(&m_cli_uart, &uart_config, true, true, NRF_LOG_SEVERITY_DEBUG);//NRF_LOG_SEVERITY_INFO);
    APP_ERROR_CHECK(err_code);
}


void cli_start(void)
{
    ret_code_t err_code =  nrf_cli_start(&m_cli_uart);
    APP_ERROR_CHECK(err_code);
}


void cli_process(void)
{
    nrf_cli_process(&m_cli_uart);
}

void tof_init(){
	ifs_tof_init(m_ifs_tof);
	for (uint8_t i = 0; i < MAXIMUM_NUMBER_OF_CENTRAL_CONN; i++) { //reset all instance of m_ifs_tof and register the same handler for each node
		ifs_tof_init_struct(&m_ifs_tof[i]);
	}
}

int main(void)
{
    log_init();

    cli_init();
    leds_init();
    timer_init();
    buttons_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_data_set();
//#ifdef DNRF52840_XXAA
//    (void) sd_ble_gap_tx_power_set(9);
//#else
//    (void) sd_ble_gap_tx_power_set(4);
//#endif
    (void) sd_ble_gap_tx_power_set(0);

    reset_network();
    client_init();
    gatt_mtu_set(m_test_params.att_mtu);
    data_len_ext_set(m_test_params.data_len_ext_enabled);
    conn_evt_len_ext_set(m_test_params.conn_evt_len_ext_enabled);
    preferred_phy_set(&m_test_params.phys);

    tof_init();

    cli_start();

    buttons_enable();
    ifs_offset_ticks = calculate_ifs_offset(m_test_params.phys);

    NRF_LOG_INFO("BLE Time of Flight example started.\n\r");
    NRF_LOG_INFO("Press button 3 for a continuous test.\n\r");
    NRF_LOG_INFO("Press button 4 for a single test.\n\r");

    NRF_LOG_INFO("Remember: every sample plotted in the terminal corresponds to %u samples averaged.\n\r",TOF_SAMPLES_TO_ACQUIRE);
    NRF_LOG_INFO("The average size is set by TOF_SAMPLES_TO_ACQUIRE in ifs_tof.h\n\r");

	for (;;) {

		cli_process();

		if (is_test_ready()) {
			NRF_LOG_INFO("Test started\n\r");
			m_run_test = true;
			test_run();
		}

		if (NRF_LOG_PROCESS() == false){
            wait_for_event();
        }
    }
}


/**
 * @}
 */
